Assignment Instructions:

1.Install [Anaconda](https://www.anaconda.com/products/individual):

    Take Python 3.x version (not 2.x)
    
    Select “Add Anaconda to System PATH” during installation


2.Jupyter notebook is part of the Anaconda package.

    Open the console (on Windows: open Anaconda Prompt) and run command

    jupyter notebook
 

3.Open "Assignment_1.ipynb" in Jupyter Notebook.



When we want to work with SQL easily in an Ipython notebook, we'll load the ipython-sql extension.

To install ipython-sql with Anaconda, using the [command](https://anaconda.org/conda-forge/ipython-sql):

    conda install -c conda-forge ipython-sql

**Note: DO NOT PANIC** 
* Don't worry if you get (a) a big red-highlighted warning or (b) a note that the extension has already been loaded!  As long as your SQL commands work, it's loaded properly!

In [18]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Next, load an SQLite database stored as a file as follows:

**NOTE: We load a file below (here, "Movie-Rating.db", which must be in the same directory as the notebook. You'll use this file throughout the first assignment. Make sure to download the from the BlackBoard exercise webpage!!**

In [19]:
%sql sqlite:///Movie-Rating.db

**`%sql` is used for single line SQL commands:**

In [20]:
%sql SELECT * FROM Movie LIMIT 5;

 * sqlite:///Movie-Rating.db
Done.

[(101, 'Gone with the Wind', 1939, 'Victor Fleming'),
 (102, 'Star Wars', 1977, 'George Lucas'),
 (103, 'The Sound of Music', 1965, 'Robert Wise'),
 (104, 'E.T.', 1982, 'Steven Spielberg'),
 (105, 'Titanic', 1997, 'James Cameron')]

And **`%%sql` is used for multi-line SQL commands:**

In [21]:
%sql SELECT SUM(r.stars) FROM Rating r, Movie m WHERE m.mID = r.mID AND m.year = 1939;

 * sqlite:///Movie-Rating.db
Done.

[(9,)]

**Assignment Descriptions**

You've started a new movie-rating website, and you've been collecting data on reviewers' ratings of various movies. There's
not much data yet, but you can still try out some interesting queries. Here's the schema:

Movie ( mID, title, year, director )
Explanation: There is a movie with ID number mID, a title, a release year, and a director.

Reviewer ( rID, name )
Explanation: The reviewer with ID number rID has a certain name.

Rating ( rID, mID, stars, ratingDate )
Explanation: The reviewer rID gave the movie mID a number of stars rating (1-5) on a certain ratingDate.

Your queries will run over a small data set conforming to the schema. You can see the data overview in the file 8- data overview.pdf.

**Instructions**

Each problem asks you to write a query in SQL. You can run your code by clicking Run button on the top of the page.

**Important Notes**

1- Your queries are executed using SQLite, so you must conform to the SQL constructs supported by SQLite.

2- Unless a specific result ordering is asked for, you can return the result rows in any order.

3- You are to translate the English into a SQL query that computes the desired result over all possible databases. I will give you the correct output two weeks later as a reference. However, just to check the answer is not enough. This means for our small sample database, even if your answer is correct, it is possible that your query does not correctly reflect the problem at hand. (For example, if we ask for a complex condition that requires accessing all of the tables, but over our small data set in the end the condition is satisfied only by Star Wars, then the query "select title from Movie where title = 'Star Wars'" will get correct answer even though it doesn't reflect the actual question.) Circumventing the system in this fashion is not a good idea to help you learn SQL. On the other hand, an incorrect attempt at a general solution is unlikely to produce the right answer, so you shouldn't be led astray by just checking the answer.

**Assignment Questions**

This assignment includes three exercises **[Movie-Rating Query Exercises], [Movie-Rating Query Exercises Extras]** and **[Movie-Rating Modification Exercises]**. All questions for Movie-Rating Query Excercises are mandatory for Exercise Assignment-1. Fill your answers in this template. The answer to the first question of the first exercise is given as an example.

**What to hand in:**

1. Generate a HTML report from this notebook template with answers (File > Download as > HTML).
2. This "Assignment_1.ipynb" file with answers.

Movie-Rating Query Exercises, Q1:
Find the titles of all movies directed by Steven Spielberg.

In [22]:
%sql SELECT title FROM movie WHERE director = 'Steven Spielberg';

 * sqlite:///Movie-Rating.db
Done.

[('E.T.',), ('Raiders of the Lost Ark',)]

Movie-Rating Query Exercises, Q2:

Find all years that have a movie that received a rating of 4 or 5, and sort them in increasing order.

In [23]:
%sql SELECT DISTINCT strftime('%Y',ratingDate) FROM Rating r WHERE r.stars > 3

 * sqlite:///Movie-Rating.db
Done.

[('2011',), (None,)]

Movie-Rating Query Exercises, Q3:

Find the titles of all movies that have no ratings.

In [24]:
%sql SELECT m.title FROM Movie m WHERE m.mID NOT IN (SELECT mID FROM Rating)

 * sqlite:///Movie-Rating.db
Done.

[('Star Wars',), ('Titanic',)]

Movie-Rating Query Exercises, Q4:

Some reviewers didn't provide a date with their rating. Find the names of all reviewers who have ratings with a NULL value
for the date.

In [25]:
%%sql SELECT name
FROM Reviewer INNER JOIN Rating
ON Reviewer.rID = Rating.rID
WHERE Rating.ratingDate IS NULL

 * sqlite:///Movie-Rating.db
Done.

[('Daniel Lewis',), ('Chris Jackson',)]

Movie-Rating Query Exercises, Q5:

Write a query to return the ratings data in a more readable format: reviewer name, movie title, stars, and ratingDate. Also,
sort the data, first by reviewer name, then by movie title, and lastly by number of stars.

In [26]:
%%sql
SELECT p.name AS "Reviewer Name", m.title AS "Movie Title", r.stars AS "Stars", r.ratingDate AS "Rating Date"
FROM Rating AS r
    INNER JOIN Reviewer AS p
    ON p.rID=r.rID
    INNER JOIN Movie m
    ON r.mID=m.mID
    ORDER BY p.name, m.title, r.stars

 * sqlite:///Movie-Rating.db
Done.

[('Ashley White', 'E.T.', 3, '2011-01-02'),
 ('Brittany Harris', 'Raiders of the Lost Ark', 2, '2011-01-30'),
 ('Brittany Harris', 'Raiders of the Lost Ark', 4, '2011-01-12'),
 ('Brittany Harris', 'The Sound of Music', 2, '2011-01-20'),
 ('Chris Jackson', 'E.T.', 2, '2011-01-22'),
 ('Chris Jackson', 'Raiders of the Lost Ark', 4, None),
 ('Chris Jackson', 'The Sound of Music', 3, '2011-01-27'),
 ('Daniel Lewis', 'Snow White', 4, None),
 ('Elizabeth Thomas', 'Avatar', 3, '2011-01-15'),
 ('Elizabeth Thomas', 'Snow White', 5, '2011-01-19'),
 ('James Cameron', 'Avatar', 5, '2011-01-20'),
 ('Mike Anderson', 'Gone with the Wind', 3, '2011-01-09'),
 ('Sarah Martinez', 'Gone with the Wind', 2, '2011-01-22'),
 ('Sarah Martinez', 'Gone with the Wind', 4, '2011-01-27')]

Movie-Rating Query Exercises, Q6:

For all cases where the same reviewer rated the same movie twice and gave it a higher rating the second time, return the
reviewer's name and the title of the movie.

In [27]:
%%sql SELECT p.name AS "Reviewer Name", m.title AS "Movie Title"
FROM Rating r
    INNER JOIN Reviewer p --We need reviewer name from Reviewer table;
    ON p.rID = r.rID
    INNER JOIN Movie m --And movie title from Movie table;
    ON r.mID = m.mID,
    Rating r2 --We "self join" Rating table to compare dates and stars;
WHERE r.rID = r2.rID
AND m.mID = r2.mID
AND r.stars > r2.stars
AND r.ratingDate > r2.ratingDate

 * sqlite:///Movie-Rating.db
Done.

[('Sarah Martinez', 'Gone with the Wind')]

Movie-Rating Query Exercises, Q7:

For each movie that has at least one rating, find the highest number of stars that movie received. Return the movie title and
number of stars. Sort by movie title.

In [28]:
%%sql SELECT m.title "Movie Title", MAX(r.stars) AS "Highest Rating"
FROM Movie m
    INNER JOIN Rating r
    ON m.mID=r.mID
GROUP BY m.title HAVING COUNT(r.mID) > 1

 * sqlite:///Movie-Rating.db
Done.

[('Avatar', 5),
 ('E.T.', 3),
 ('Gone with the Wind', 4),
 ('Raiders of the Lost Ark', 4),
 ('Snow White', 5),
 ('The Sound of Music', 3)]

Movie-Rating Query Exercises, Q8:

For each movie, return the title and the 'rating spread', that is, the difference between highest and lowest ratings given to that movie. Sort by rating spread from highest to lowest, then by movie title.

In [29]:
%%sql
SELECT
    m.title "Movie Title",
    MAX(r.stars) AS "Highest Rating",
    MIN(r.stars) AS "Lowest Rating",
    MAX(r.stars)-MIN(r.stars) AS "Rating Spread"
FROM Movie m
    INNER JOIN Rating r
    ON m.mID=r.mID
GROUP BY m.title
ORDER BY "Rating Spread" DESC, m.title ASC

 * sqlite:///Movie-Rating.db
Done.

[('Avatar', 5, 3, 2),
 ('Gone with the Wind', 4, 2, 2),
 ('Raiders of the Lost Ark', 4, 2, 2),
 ('E.T.', 3, 2, 1),
 ('Snow White', 5, 4, 1),
 ('The Sound of Music', 3, 2, 1)]

Movie-Rating Query Exercises, Q9:

Find the difference between the average rating of movies released before 1980 and the average rating of movies released
after 1980. (Make sure to calculate the average rating for each movie, then the average of those averages for movies before
1980 and movies after. Don't just calculate the overall average rating before and after 1980.)

In [33]:
%%sql
SELECT AVG(pre.avg) as "pre 1980 avg", AVG(post.avg) as "post 1980 avg", (AVG(pre.avg) - AVG(post.avg)) AS "Average Difference"
FROM

-- Pre 1980 Averages
(SELECT m.title, AVG(r.stars) AS avg
    FROM Rating r
    JOIN Movie m
    ON m.mID=r.mID
    WHERE m.year <= 1980
    GROUP BY m.title) pre,

-- Post 1980 Averages
(SELECT m.title, AVG(r.stars) AS avg
    FROM Rating r
    JOIN Movie m
    ON r.mID=m.mID
    WHERE m.year > 1980
    GROUP BY m.title) post

 * sqlite:///Movie-Rating.db
Done.

[(3.3333333333333335, 3.2777777777777777, 0.0555555555555558)]

Movie-Rating Query Exercises Extras, Q1:

Find the names of all reviewers who rated Gone with the Wind.

Movie-Rating Query Exercises Extras, Q2:

For any rating where the reviewer is the same as the director of the movie, return the reviewer name, movie title, and
number of stars.

Movie-Rating Query Exercises Extras, Q3:

Return all reviewer names and movie names together in a single list, alphabetized. (Sorting by the first name of the reviewer
and first word in the title is fine; no need for special processing on last names or removing "The".)

Movie-Rating Query Exercises Extras, Q4:

Find the titles of all movies not reviewed by Chris Jackson.

Movie-Rating Query Exercises Extras, Q5:

For all pairs of reviewers such that both reviewers gave a rating to the same movie, return the names of both reviewers.
Eliminate duplicates, don't pair reviewers with themselves, and include each pair only once. For each pair, return the names
in the pair in alphabetical order.

Movie-Rating Query Exercises Extras, Q6:

For each rating that is the lowest (fewest stars) currently in the database, return the reviewer name, movie title, and number
of stars.

Movie-Rating Query Exercises Extras, Q7:

List movie titles and average ratings, from highest-rated to lowest-rated. If two or more movies have the same average rating,
list them in alphabetical order.

Movie-Rating Query Exercises Extras, Q8:

Find the names of all reviewers who have contributed three or more ratings. (As an extra challenge, try writing the query
without HAVING or without COUNT.)

Movie-Rating Query Exercises Extras, Q9:

Some directors directed more than one movie. For all such directors, return the titles of all movies directed by them, along
with the director name. Sort by director name, then movie title. (As an extra challenge, try writing the query both with and
without COUNT.)

Movie-Rating Query Exercises Extras, Q10:

Find the movie(s) with the highest average rating. Return the movie title(s) and average rating. (Hint: This query is more
difficult to write in SQLite than other systems; you might think of it as finding the highest average rating and then choosing
the movie(s) with that average rating.)

Movie-Rating Query Exercises Extras, Q11:

Find the movie(s) with the lowest average rating. Return the movie title(s) and average rating. (Hint: This query may be more
difficult to write in SQLite than other systems; you might think of it as finding the lowest average rating and then choosing
the movie(s) with that average rating.)

Movie-Rating Query Exercises Extras, Q12:

For each director, return the director's name together with the title(s) of the movie(s) they directed that received the highest
rating among all of their movies, and the value of that rating. Ignore movies whose director is NULL.

**To check your data modification statement, we ran the following query after your modification: select * from Movie order by
mID**

Movie-Rating Modification Exercises, Q1:

Add the reviewer Roger Ebert to your database, with an rID of 209.

Movie-Rating Modification Exercises, Q2:

Insert 5-star ratings by James Cameron for all movies in the database. Leave the review date as NULL.

Movie-Rating Modification Exercises, Q3:

For all movies that have an average rating of 4 stars or higher, add 25 to the release year. (Update the existing tuples; don't
insert new tuples.)

Movie-Rating Modification Exercises, Q4:

Remove all ratings where the movie's year is before 1970 or after 2000, and the rating is fewer than 4 stars.